---
kind: property
id: P:Autodesk.Revit.DB.MultiReferenceAnnotationOptions.DimensionLineDirection
source: html/fa626cb8-ed9c-5f71-1a2a-1df5c15a959c.htm
---
# Autodesk.Revit.DB.MultiReferenceAnnotationOptions.DimensionLineDirection Property

The direction vector of the dimension line.

## Syntax (C#)
```csharp
public XYZ DimensionLineDirection { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: dimensionLineDirection is not length 1.0.